app/controllers/api/v1/habits_controller.rb

    def update
        if @habit.update(habit_params)
---
UPDATE "habits" SET "description" = $1, "updated_at" = $2 WHERE "habits"."id" = $3  [["description", "wake up before 8:31 am every day"], ["updated_at", "2020-01-09 15:04:25.774875"], ["id", 2]]

    def create
        @habit = Habit.new(habit_params)
        @habit.user = current_user
        authorize @habit
        if @habit.save
---
INSERT INTO "habits" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-01-26 05:49:51.383348"], ["updated_at", "2020-01-26 05:49:51.383348"]]

    def destroy
        @habit.destroy
---
DELETE FROM "habits" WHERE "habits"."id" = $1  [["id", 1]]

    def set_habit
        @habit = Habit.find(params[:id])
---
SELECT  "habits".* FROM "habits" WHERE "habits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]