app/controllers/api/v1/sessions_controller.rb

    def create
        user = User.where(email: params[:user][:email]).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "tjtonyjiang12@gmail.com"], ["LIMIT", 1]]

    def signup
        @new_user = User.new(user_params)
        if @new_user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "authentication_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def destroy
        @user = User.find(params[:id])
        @user.authentication_token = nil
        if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "authentication_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["authentication_token", "48KuiYqH7v6X76GnKEHi"], ["updated_at", "2020-01-14 09:49:48.329490"], ["id", 7]]