app/controllers/api/v1/web_controller.rb

    def habit_menu
        @habits = Habit.where(user: @user)
---
SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = $1  [["user_id", 1]]